In [1]:
import pandas as pd
import sqlite3

In [2]:
new = sqlite3.connect("students_clg.db")   
c = new.cursor()

In [5]:
c.execute("select * from students_data")
output =c.fetchall()
print(output)

[]

In [6]:
stud_data = [
    {"id": 1, "college_name": "MIT"},
    {"id": 2, "college_name": "Stanford"},
    {"id": 3, "college_name": "Harvard"},
    {"id": 4, "college_name": "Yale"},
    {"id": 5, "college_name": "Princeton"},
    {"id": 6, "college_name": "Columbia"},
    {"id": 7, "college_name": "Caltech"},
    {"id": 8, "college_name": "UCLA"},
    {"id": 9, "college_name": "Berkeley"},
    {"id": 10, "college_name": "Cornell"},
    {"id": 11, "college_name": "University of Chicago"},
    {"id": 12, "college_name": "Johns Hopkins University"},
    {"id": 13, "college_name": "Duke University"},
    {"id": 14, "college_name": "Northwestern University"},
    {"id": 15, "college_name": "University of Michigan"}]

query = """INSERT INTO students_data Values (:id, :college_name)
;"""
c.executemany(query, stud_data)
new.commit()
c.execute("select * from students_data")
output = c.fetchall()
print(output)

[(1, 'MIT'), (2, 'Stanford'), (3, 'Harvard'), (4, 'Yale'), (5, 'Princeton'), (6, 'Columbia'), (7, 'Caltech'), (8, 'UCLA'), (9, 'Berkeley'), (10, 'Cornell'), (11, 'University of Chicago'), (12, 'Johns Hopkins University'), (13, 'Duke University'), (14, 'Northwestern University'), (15, 'University of Michigan')]

In [7]:
c.execute("SELECT * FROM students_data")
output = c.fetchall()
df = pd.DataFrame(output, columns=['id','college_name'])
df

    id              college_name
0    1                       MIT
1    2                  Stanford
2    3                   Harvard
3    4                      Yale
4    5                 Princeton
5    6                  Columbia
6    7                   Caltech
7    8                      UCLA
8    9                  Berkeley
9   10                   Cornell
10  11     University of Chicago
11  12  Johns Hopkins University
12  13           Duke University
13  14   Northwestern University
14  15    University of Michigan